#include <Arduino.h>    
int threshold = 11;     // Встановлення порогового значення чутливості сенсора
int touchValue;         // Оголошення змінної для зберігання зчитаного значення з сенсора
bool isReleased = true; // Прапор для відстеження стану (чи відпущений сенсор зараз)

void setup()           
{
  Serial.begin(115200); 
} 
void loop() 
{
  touchValue = touchRead(4);                 // Зчитування поточного значення з сенсорного піна 4
  
  if (touchValue <= threshold && isReleased) // Перевірка, чи відбувся новий дотик (значення впало нижче порогу)
  {
    Serial.println("Pin touched"); // Вивід повідомлення про натискання у монітор порту
    isReleased = false;            // Оновлення стану: сенсор більше не вважається відпущеним
  }
  else if (touchValue > threshold && !isReleased) // Перевірка, чи сенсор щойно відпустили (значення стало вище порогу)
  {
    Serial.println("Pin released"); // Вивід повідомлення про відпускання у монітор порту
    isReleased = true;              // Оновлення стану: сенсор знову вважається відпущеним
  }
} 