#include <Arduino.h>     // Підключення основної бібліотеки Arduino
unsigned long int timer; // Оголошення змінної для зберігання часу (таймера)

void setup()
{
  Serial.begin(115200); // Ініціалізація послідовного порту на швидкості 115200 бод
  timer = millis();     // Запис поточного часу в мілісекундах у змінну timer
}

void loop()
{
  if (millis() - timer >= 100)// Перевірка, чи пройшло 100 мілісекунд з моменту останньої дії
  {                                                        
    Serial.println("Touch value:" + (String)touchRead(4)); // Зчитування значення з сенсорного піна 4 та вивід його в монітор порту
    timer = millis();                                      // Оновлення значення змінної timer поточним часом
  }
}